0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
       type            zeroGradient;
    }
    inlet
    {
       type            zeroGradient;
    }
    outlet
    {
       type            fixedValue;
       value           uniform 0;
    }
    block1
    {
       type            zeroGradient;
    }
    block2
    {
       type            zeroGradient;
    }
    block3
    {
       type            zeroGradient;
    }
}


// ************************************************************************* //
